Tekla Open API Reference for Tekla Structures 2025
DrawingPluginBase.InputDefinition Constructor (Identifier, Point, Point, Point)
 Creates a new input definition instance with three points.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public InputDefinition(
	Identifier viewId,
	Point point1,
	Point point2,
	Point point3
)
Public Sub New (
	viewId As Identifier,
	point1 As Point,
	point2 As Point,
	point3 As Point
)
Parameters
viewId
Type: Tekla.Structures.Identifier
The identifier for the view object.
point1
Type: Tekla.Structures.Geometry3d.Point
The first point.
point2
Type: Tekla.Structures.Geometry3d.Point
The second point.
point3
Type: Tekla.Structures.Geometry3d.Point
The third point.
See Also
Reference
DrawingPluginBase.InputDefinition Class
DrawingPluginBase.InputDefinition Overload
Tekla.Structures.Plugins Namespace